<meta charset="utf-8">
<?php 



$txt= "ثبات قیمت  34  +() سکه+در9 (س)    asdasd_+))(*&9بازار     ~~``       دلار   ";

$txt = strip_tags($txt);
		$no_char = array(
		'?','!','>','@','/','\/','+','|','@','#','$','%','^','&','*','؛',':','.','؟','٬','٫','«','»','،',
		'۱','۲','۳','۴','۵','۶','۷','۸','۹','۰','(',')','\'','"','¦','{','}','[',']','°','<','>',';',',',
		'=','-','_','`','~'
		);
		$str = str_replace($no_char,' ', $txt);
		$str = ereg_replace("([a-zA-Z]+)",' ', $str);
		$str = ereg_replace("([0-9]+)",' ', $str);
		$str = preg_replace('!\s+!', ' ', $str);
echo $str;

?>